server/app/admin/products.rb

INSERT INTO "products" ("category_id", "created_at", "description", "price", "slug", "stock", "title", "updated_at") VALUES (10, '2026-03-09 14:56:47.765775', 'replicas ', 9.0, 'rolex', 3, 'reloj rolex', '2026-03-09 14:56:47.765775') RETURNING "id"
UPDATE "products" SET "updated_at" = '2026-03-04 14:58:33.979449' WHERE "products"."id" = 16
---
    def create
      build_resource
      resource.assign_attributes(product_params.except(:sizes_data))
      apply_sizes_data

      if resource.save

UPDATE "products" SET "updated_at" = '2026-03-09 13:11:19.655789' WHERE "products"."id" = 16
---
    def update
      resource.assign_attributes(product_params.except(:sizes_data))
      apply_sizes_data

      if resource.save