server/app/controllers/api/v1/cart_items_controller.rb

def index
    @cart_items = current_user.cart_items.includes(:product, :variant)
    items_json = @cart_items.map do |item|
      product = item.product
      {
        id: item.id,
        quantity: item.quantity,
        variant: item.variant ? { id: item.variant.id, name: item.variant.name } : nil,
        product: {
          id: product.id,
          title: product.title,
          price: product.price,
          stock: product.stock,
          image_url: product.image.attached? ? Rails.application.routes.url_helpers.rails_storage_proxy_url(product.image, only_path: false) : nil
        }
      }
    end
    render_success(data: {
      items: items_json,
      total: @cart_items.sum { |item| item.product.price * item.quantity }
    })
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 28]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1  [["id", 12]]

  def create
    @cart_item = current_user.cart_items.find_or_initialize_by(product_id: params[:product_id], variant_id: params[:variant_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."product_id" = $2 AND "cart_items"."variant_id" IS NULL LIMIT $3  [["user_id", 29], ["product_id", 14], ["LIMIT", 1]]

  def update
    @cart_item = current_user.cart_items.find(params[:id])
    if @cart_item.update(quantity: params[:quantity])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."id" = $2 LIMIT $3  [["user_id", 30], ["id", 3], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 5], ["updated_at", "2026-04-15 14:50:22.515367"], ["id", 3]]

  def destroy
    @cart_item = current_user.cart_items.find(params[:id])
    @cart_item.destroy
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."id" = $2 LIMIT $3  [["user_id", 31], ["id", 4], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 4]]