server/app/controllers/api/v1/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "name", "slug", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-04-15 14:50:22.942312"], ["description", nil], ["name", "New Category"], ["slug", "new-category"], ["updated_at", "2026-04-15 14:50:22.942312"]]
---
  def create
    authorize Category
    @category = Category.new(category_params)
    if @category.save