server/app/controllers/api/v1/orders_controller.rb

  def index
    @orders = current_user.orders.order(created_at: :desc)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."created_at" DESC  [["user_id", 37]]

  def show
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 38], ["id", 17], ["LIMIT", 1]]

  def create
    @order = current_user.orders.new(order_params)
    @order.status = :pending
    @order.payment_status = "pending"

    cart_items = current_user.cart_items.includes(:product)
    if cart_items.empty?
      render_error("Cart is empty")
      return
    end

    cart_items.each do |item|
      if item.product.stock < item.quantity
        render_error("Insufficient stock for #{item.product.title}")
        return
      end
    end

    @order.total = cart_items.sum { |item| item.product.price * item.quantity }

    if @order.save
      cart_items.each do |item|
        @order.order_items.create!(
          product: item.product,
          quantity: item.quantity,
          unit_price: item.product.price
        )
        item.product.decrement!(:stock, item.quantity)
      end
      cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 39]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."user_id" = $1 LIMIT $2  [["user_id", 39], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1  [["id", 18]]
INSERT INTO "orders" ("created_at", "payment_id", "payment_method", "payment_status", "reference", "shipping_address", "status", "total", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "order_items" ("created_at", "order_id", "product_id", "quantity", "unit_price", "updated_at", "variant_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2026-04-21 14:04:26.050720"], ["order_id", 18], ["product_id", 19], ["quantity", 2], ["unit_price", "100.0"], ["updated_at", "2026-04-21 14:04:26.050720"], ["variant_id", nil]]
UPDATE "products" SET "stock" = COALESCE("products"."stock", 0) - $1 WHERE "products"."id" = $2  [["stock", 2], ["id", 18]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 7]]