server/app/controllers/api/v1/payments_controller.rb

  def create_preference
    @order = current_user.orders.find(params[:id])

    if @order.order_items.empty?
      render_error("Order has no items")
      return
    end

    unless @order.pending?
      render_error("Order is not available for payment")
      return
    end

    access_token = ENV["MP_ACCESS_TOKEN"].presence || "TEST-9140410657904033-030213-9a0d8e8b8b8b8b8b8b8b8b8-12345678"
    sdk = Mercadopago::SDK.new(access_token)
    unless sdk.present?
      render_error("Could not initialize Mercado Pago SDK")
      return
    end

    preference_response = sdk.preference.create(preference_data)
    preference = preference_response[:response]

    if preference.blank? || preference["id"].blank? || preference["init_point"].blank?
      render_error("Could not create payment preference")
      return
    end

    @order.update!(payment_id: preference["id"])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 77], ["id", 51], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 156]]
SELECT 1 AS one FROM "order_items" WHERE "order_items"."order_id" = $1 LIMIT $2  [["order_id", 51], ["LIMIT", 1]]
UPDATE "orders" SET "payment_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["payment_id", "pref_123"], ["updated_at", "2026-03-24 13:49:37.250538"], ["id", 156]]