server/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
SELECT products.*, COUNT(order_items.id) as sales_count FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" LEFT OUTER JOIN "order_items" ON "order_items"."product_id" = "products"."id" WHERE NOT ((categories.name ILIKE '%Digital%')) GROUP BY "products"."id" ORDER BY sales_count DESC
SELECT products.*, COUNT(order_items.id) as sales_count FROM "products" LEFT OUTER JOIN "order_items" ON "order_items"."product_id" = "products"."id" GROUP BY "products"."id" ORDER BY sales_count DESC
SELECT products.*, COUNT(order_items.id) as sales_count FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" LEFT OUTER JOIN "order_items" ON "order_items"."product_id" = "products"."id" WHERE (categories.name = 'Arte Digital') GROUP BY "products"."id" ORDER BY sales_count DESC
SELECT "products".* FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" WHERE (categories.name = 'Arte Digital') ORDER BY "products"."created_at" DESC
---
  def index
    @products = Product.all

    if params[:category].present? && params[:category] != "all"
      if params[:category] == "digital"
        @products = @products.joins(:category).where("categories.name ILIKE ?", "%Digital%")
      elsif params[:category] == "physical"
        @products = @products.joins(:category).where.not("categories.name ILIKE ?", "%Digital%")
      else
        @products = @products.joins(:category).where("categories.name = ?", params[:category])
      end
    end

    if params[:sort] == "popular"
      @products = @products.left_joins(:order_items)
                           .group(:id)
                           .select("products.*, COUNT(order_items.id) as sales_count")
                           .order("sales_count DESC")
    else
      @products = @products.order(created_at: :desc)

INSERT INTO "products" ("category_id", "created_at", "description", "image", "image_url", "name", "price", "product_type", "slug", "stock", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    authorize Product
    @product = Product.new(product_params)
    if @product.save