server/app/controllers/api/v1/products_controller.rb

  def index
    @q = Product.ransack(params[:q])
    @products = @q.result(distinct: true)

    if params[:category].present? && params[:category] != "all"
      @products = @products.joins(:category).where("categories.name = ?", params[:category])
    end

    if params[:sort] == "popular"
      @products = @products.left_joins(:order_items)
                           .group(:id)
                           .select("products.*, COUNT(order_items.id) as sales_count")
                           .order("sales_count DESC")
    else
      @products = @products.order(created_at: :desc)
---
SELECT DISTINCT "products".* FROM "products" ORDER BY "products"."created_at" DESC