server/app/controllers/api/v1/webhooks_controller.rb

UPDATE "orders" SET "payment_id" = $1, "payment_status" = $2, "status" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["payment_id", "tx-f9177e20"], ["payment_status", "approved"], ["status", 1], ["updated_at", "2026-04-15 14:50:28.701335"], ["id", 35]]
---
  def wompi
    raw_body = request.raw_post
    payload = JSON.parse(raw_body)
    transaction = payload.dig("data", "transaction") || {}
    reference = transaction["reference"]
    order = find_order_by_reference(reference)
    payment_status = map_wompi_status(transaction["status"])
    transaction_id = transaction["id"].presence || "wompi-#{reference.presence || SecureRandom.hex(6)}"

    event_key = "wompi:#{transaction_id}:#{transaction['status'].to_s.downcase}"

    Rails.logger.info "Received Wompi event: reference=#{reference.inspect} status=#{transaction['status']} event_key=#{event_key}"

    if order && payment_status.present?
      if WebhookEvent.claim(provider: "wompi", event_key: event_key)
        begin
          order.transaction do
            payment = order.payments.find_or_initialize_by(transaction_id: transaction_id)
            payment.provider = "wompi"
            payment.status = transaction["status"]
            payment.save!