server/app/controllers/api/v1/webhooks_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."reference" = $1 LIMIT $2  [["reference", "order-51b8577a"], ["LIMIT", 1]]
---
  def find_order_for_payment(payment)
    order_reference = payment['external_reference']
    return Order.find_by(id: order_reference) if order_reference.present?