server/app/controllers/api/v1/webhooks_controller.rb

  def wompi
    raw_body = request.raw_post
    payload = JSON.parse(raw_body)
    transaction = payload.dig("data", "transaction") || {}
    reference = transaction["reference"]
    order = find_order_by_reference(reference)
    payment_status = map_wompi_status(transaction["status"])

    Rails.logger.info "Received Wompi event: reference=#{reference.inspect} status=#{transaction['status']}"

    if order && payment_status.present?
      transaction_id = transaction["id"].presence || "wompi-#{SecureRandom.hex(6)}"

      order.transaction do
        order.payments.create!(
          provider: "wompi",
          transaction_id: transaction_id,
          status: transaction["status"]
        )
---
INSERT INTO "payments" ("created_at", "order_id", "provider", "status", "transaction_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-04-15 14:50:28.698202"], ["order_id", 35], ["provider", "wompi"], ["status", "APPROVED"], ["transaction_id", "tx-f9177e20"], ["updated_at", "2026-04-15 14:50:28.698202"]]