server/app/models/user.rb

  def self.find_for_jwt_authentication_from_token(token)
    secret = ENV.fetch("DEVISE_JWT_SECRET_KEY")

    begin
      decoded = JWT.decode(token, secret, true, algorithm: "HS256")
      payload = decoded[0]
      user_id = payload["sub"]
      jti = payload["jti"]

      return nil if JwtDenylist.exists?(jti: jti)
---
SELECT 1 AS one FROM "jwt_denylist" WHERE "jwt_denylist"."jti" = '7d1f4068-c019-4fe8-b0c6-ba16fcc26aa6' LIMIT 1