server/app/controllers/api/v1/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def create
    self.resource = User.find_for_database_authentication(email: sign_in_params[:email])